metalsky/DK5438_example/综合应用/05-uCOS-II与触控GUI/App/msp430x54xBK.h
/* ADC12CTL1 Control Bits */
#define ADC12BUSY           (0x0001)    /* ADC12 Busy */
#define ADC12CONSEQ0        (0x0002)    /* ADC12 Conversion Sequence Select 0 */
#define ADC12CONSEQ1        (0x0004)    /* ADC12 Conversion Sequence Select 1 */
#define ADC12SSEL0          (0x0008)    /* ADC12 Clock Source Select 0 */
#define ADC12SSEL1          (0x0010)    /* ADC12 Clock Source Select 1 */
#define ADC12DIV0           (0x0020)    /* ADC12 Clock Divider Select 0 */
#define ADC12DIV1           (0x0040)    /* ADC12 Clock Divider Select 1 */
#define ADC12DIV2           (0x0080)    /* ADC12 Clock Divider Select 2 */
#define ADC12ISSH           (0x0100)    /* ADC12 Invert Sample Hold Signal */
#define ADC12SHP            (0x0200)    /* ADC12 Sample/Hold Pulse Mode */
#define ADC12SHS0           (0x0400)    /* ADC12 Sample/Hold Source 0 */
#define ADC12SHS1           (0x0800)    /* ADC12 Sample/Hold Source 1 */
#define ADC12CSTARTADD0     (0x1000)    /* ADC12 Conversion Start Address 0 */
#define ADC12CSTARTADD1     (0x2000)    /* ADC12 Conversion Start Address 1 */
#define ADC12CSTARTADD2     (0x4000)    /* ADC12 Conversion Start Address 2 */
#define ADC12CSTARTADD3     (0x8000)    /* ADC12 Conversion Start Address 3 */

/* ADC12CTL1 Control Bits */
#define ADC12BUSY_L         (0x0001)    /* ADC12 Busy */
#define ADC12CONSEQ0_L      (0x0002)    /* ADC12 Conversion Sequence Select 0 */
#define ADC12CONSEQ1_L      (0x0004)    /* ADC12 Conversion Sequence Select 1 */
#define ADC12SSEL0_L        (0x0008)    /* ADC12 Clock Source Select 0 */
#define ADC12SSEL1_L        (0x0010)    /* ADC12 Clock Source Select 1 */
#define ADC12DIV0_L         (0x0020)    /* ADC12 Clock Divider Select 0 */
#define ADC12DIV1_L         (0x0040)    /* ADC12 Clock Divider Select 1 */
#define ADC12DIV2_L         (0x0080)    /* ADC12 Clock Divider Select 2 */

/* ADC12CTL1 Control Bits */
#define ADC12ISSH_H         (0x0001)    /* ADC12 Invert Sample Hold Signal */
#define ADC12SHP_H          (0x0002)    /* ADC12 Sample/Hold Pulse Mode */
#define ADC12SHS0_H         (0x0004)    /* ADC12 Sample/Hold Source 0 */
#define ADC12SHS1_H         (0x0008)    /* ADC12 Sample/Hold Source 1 */
#define ADC12CSTARTADD0_H   (0x0010)    /* ADC12 Conversion Start Address 0 */
#define ADC12CSTARTADD1_H   (0x0020)    /* ADC12 Conversion Start Address 1 */
#define ADC12CSTARTADD2_H   (0x0040)    /* ADC12 Conversion Start Address 2 */
#define ADC12CSTARTADD3_H   (0x0080)    /* ADC12 Conversion Start Address 3 */

#define ADC12CONSEQ_0        (0*2u)
#define ADC12CONSEQ_1        (1*2u)
#define ADC12CONSEQ_2        (2*2u)
#define ADC12CONSEQ_3        (3*2u)
#define ADC12SSEL_0          (0*8u)
#define ADC12SSEL_1          (1*8u)
#define ADC12SSEL_2          (2*8u)
#define ADC12SSEL_3          (3*8u)
#define ADC12DIV_0           (0*0x20u)
#define ADC12DIV_1           (1*0x20u)
#define ADC12DIV_2           (2*0x20u)
#define ADC12DIV_3           (3*0x20u)
#define ADC12DIV_4           (4*0x20u)
#define ADC12DIV_5           (5*0x20u)
#define ADC12DIV_6           (6*0x20u)
#define ADC12DIV_7           (7*0x20u)
#define ADC12SHS_0           (0*0x400u)
#define ADC12SHS_1           (1*0x400u)
#define ADC12SHS_2           (2*0x400u)
#define ADC12SHS_3           (3*0x400u)
#define ADC12CSTARTADD_0     (0*0x1000u)
#define ADC12CSTARTADD_1     (1*0x1000u)
#define ADC12CSTARTADD_2     (2*0x1000u)
#define ADC12CSTARTADD_3     (3*0x1000u)
#define ADC12CSTARTADD_4     (4*0x1000u)
#define ADC12CSTARTADD_5     (5*0x1000u)
#define ADC12CSTARTADD_6     (6*0x1000u)
#define ADC12CSTARTADD_7     (7*0x1000u)
#define ADC12CSTARTADD_8     (8*0x1000u)
#define ADC12CSTARTADD_9     (9*0x1000u)
#define ADC12CSTARTADD_10    (10*0x1000u)
#define ADC12CSTARTADD_11    (11*0x1000u)
#define ADC12CSTARTADD_12    (12*0x1000u)
#define ADC12CSTARTADD_13    (13*0x1000u)
#define ADC12CSTARTADD_14    (14*0x1000u)
#define ADC12CSTARTADD_15    (15*0x1000u)

/* ADC12CTL2 Control Bits */
#define ADC12REFBURST       (0x0001)    /* ADC12+ Reference Burst */
#define ADC12REFOUT         (0x0002)    /* ADC12+ Reference Out */
#define ADC12SR             (0x0004)    /* ADC12+ Sampling Rate */
#define ADC12DF             (0x0008)    /* ADC12+ Data Format */
#define ADC12RES0           (0x0010)    /* ADC12+ Resolution Bit: 0 */
#define ADC12RES1           (0x0020)    /* ADC12+ Resolution Bit: 1 */
#define ADC12TCOFF          (0x0080)    /* ADC12+ Temperature Sensor Off */
#define ADC12PDIF0          (0x0100)    /* ADC12+ predivider 0:/1   1:/4 */

/* ADC12CTL2 Control Bits */
#define ADC12REFBURST_L     (0x0001)    /* ADC12+ Reference Burst */
#define ADC12REFOUT_L       (0x0002)    /* ADC12+ Reference Out */
#define ADC12SR_L           (0x0004)    /* ADC12+ Sampling Rate */
#define ADC12DF_L           (0x0008)    /* ADC12+ Data Format */
#define ADC12RES0_L         (0x0010)    /* ADC12+ Resolution Bit: 0 */
#define ADC12RES1_L         (0x0020)    /* ADC12+ Resolution Bit: 1 */
#define ADC12TCOFF_L        (0x0080)    /* ADC12+ Temperature Sensor Off */

/* ADC12CTL2 Control Bits */
#define ADC12PDIF0_H        (0x0001)    /* ADC12+ predivider 0:/1   1:/4 */

#define ADC12RES_0          (0x0000)    /* ADC12+ Resolution : 8 Bit */
#define ADC12RES_1          (0x0010)    /* ADC12+ Resolution : 10 Bit */
#define ADC12RES_2          (0x0020)    /* ADC12+ Resolution : 12 Bit */
#define ADC12RES_3          (0x0030)    /* ADC12+ Resolution : reserved */

/* ADC12MCTLx Control Bits */
#define ADC12INCH0          (0x0001)    /* ADC12 Input Channel Select Bit 0 */
#define ADC12INCH1          (0x0002)    /* ADC12 Input Channel Select Bit 1 */
#define ADC12INCH2          (0x0004)    /* ADC12 Input Channel Select Bit 2 */
#define ADC12INCH3          (0x0008)    /* ADC12 Input Channel Select Bit 3 */
#define ADC12SREF0          (0x0010)    /* ADC12 Select Reference Bit 0 */
#define ADC12SREF1          (0x0020)    /* ADC12 Select Reference Bit 1 */
#define ADC12SREF2          (0x0040)    /* ADC12 Select Reference Bit 2 */
#define ADC12EOS            (0x0080)    /* ADC12 End of Sequence */

/* ADC12MCTLx Control Bits */
#define ADC12INCH0_L        (0x0001)    /* ADC12 Input Channel Select Bit 0 */
#define ADC12INCH1_L        (0x0002)    /* ADC12 Input Channel Select Bit 1 */
#define ADC12INCH2_L        (0x0004)    /* ADC12 Input Channel Select Bit 2 */
#define ADC12INCH3_L        (0x0008)    /* ADC12 Input Channel Select Bit 3 */
#define ADC12SREF0_L        (0x0010)    /* ADC12 Select Reference Bit 0 */
#define ADC12SREF1_L        (0x0020)    /* ADC12 Select Reference Bit 1 */
#define ADC12SREF2_L        (0x0040)    /* ADC12 Select Reference Bit 2 */
#define ADC12EOS_L          (0x0080)    /* ADC12 End of Sequence */

/* ADC12MCTLx Control Bits */

#define ADC12INCH_0         (0)
#define ADC12INCH_1         (1)
#define ADC12INCH_2         (2)
#define ADC12INCH_3         (3)
#define ADC12INCH_4         (4)
#define ADC12INCH_5         (5)
#define ADC12INCH_6         (6)
#define ADC12INCH_7         (7)
#define ADC12INCH_8         (8)
#define ADC12INCH_9         (9)
#define ADC12INCH_10        (10)
#define ADC12INCH_11        (11)
#define ADC12INCH_12        (12)
#define ADC12INCH_13        (13)
#define ADC12INCH_14        (14)
#define ADC12INCH_15        (15)

#define ADC12SREF_0         (0*0x10u)
#define ADC12SREF_1         (1*0x10u)
#define ADC12SREF_2         (2*0x10u)
#define ADC12SREF_3         (3*0x10u)
#define ADC12SREF_4         (4*0x10u)
#define ADC12SREF_5         (5*0x10u)
#define ADC12SREF_6         (6*0x10u)
#define ADC12SREF_7         (7*0x10u)

/* ADC12IV Definitions */
#define ADC12IV_NONE        (0x0000)    /* No Interrupt pending */
#define ADC12IV_ADC12OVIFG  (0x0002)    /* ADC12OVIFG */
#define ADC12IV_ADC12TOVIFG (0x0004)    /* ADC12TOVIFG */
#define ADC12IV_ADC12IFG0   (0x0006)    /* ADC12IFG0 */
#define ADC12IV_ADC12IFG1   (0x0008)    /* ADC12IFG1 */
#define ADC12IV_ADC12IFG2   (0x000A)    /* ADC12IFG2 */
#define ADC12IV_ADC12IFG3   (0x000C)    /* ADC12IFG3 */
#define ADC12IV_ADC12IFG4   (0x000E)    /* ADC12IFG4 */
#define ADC12IV_ADC12IFG5   (0x0010)    /* ADC12IFG5 */
#define ADC12IV_ADC12IFG6   (0x0012)    /* ADC12IFG6 */
#define ADC12IV_ADC12IFG7   (0x0014)    /* ADC12IFG7 */
#define ADC12IV_ADC12IFG8   (0x0016)    /* ADC12IFG8 */
#define ADC12IV_ADC12IFG9   (0x0018)    /* ADC12IFG9 */
#define ADC12IV_ADC12IFG10  (0x001A)    /* ADC12IFG10 */
#define ADC12IV_ADC12IFG11  (0x001C)    /* ADC12IFG11 */
#define ADC12IV_ADC12IFG12  (0x001E)    /* ADC12IFG12 */
#define ADC12IV_ADC12IFG13  (0x0020)    /* ADC12IFG13 */
#define ADC12IV_ADC12IFG14  (0x0022)    /* ADC12IFG14 */
#define ADC12IV_ADC12IFG15  (0x0024)    /* ADC12IFG15 */

