metalsky/DK5438_example/综合应用/05-uCOS-II与触控GUI/App/msp430x54xBK.h
#define RTCCTL01_           (0x0480)  /* Real Timer Control 0/1 */
DEFCW(  RTCCTL01          , RTCCTL01_)
#define RTCCTL23_           (0x0482)  /* Real Timer Control 2/3 */
DEFCW(  RTCCTL23          , RTCCTL23_)
#define RTCPS0CTL_          (0x0488)  /* Real Timer Prescale Timer 0 Control */
DEFCW(  RTCPS0CTL         , RTCPS0CTL_)
#define RTCPS1CTL_          (0x048A)  /* Real Timer Prescale Timer 1 Control */
DEFCW(  RTCPS1CTL         , RTCPS1CTL_)
#define RTCPS_              (0x048C)  /* Real Timer Prescale Timer Control */
DEFCW(  RTCPS             , RTCPS_)
#define RTCIV_              (0x048E)  /* Real Time Clock Interrupt Vector */
DEFW(   RTCIV             , RTCIV_)
#define RTCTIM0_            (0x0490)  /* Real Time Clock Time 0 */
DEFCW(  RTCTIM0           , RTCTIM0_)
#define RTCTIM1_            (0x0492)  /* Real Time Clock Time 1 */
DEFCW(  RTCTIM1           , RTCTIM1_)
#define RTCDATE_            (0x0494)  /* Real Time Clock Date */
DEFCW(  RTCDATE           , RTCDATE_)
#define RTCYEAR_            (0x0496)  /* Real Time Clock Year */
DEFCW(  RTCYEAR           , RTCYEAR_)
#define RTCAMINHR_          (0x0498)  /* Real Time Clock Alarm Min/Hour */
DEFCW(  RTCAMINHR         , RTCAMINHR_)
#define RTCADOWDAY_         (0x049A)  /* Real Time Clock Alarm day of week/day */
DEFCW(  RTCADOWDAY        , RTCADOWDAY_)

#define RTCCTL0             RTCCTL01_L  /* Real Time Clock Control 0 */
#define RTCCTL1             RTCCTL01_H  /* Real Time Clock Control 1 */
#define RTCCTL2             RTCCTL23_L  /* Real Time Clock Control 2 */
#define RTCCTL3             RTCCTL23_H  /* Real Time Clock Control 3 */
#define RTCNT12             RTCTIM0
#define RTCNT34             RTCTIM1
#define RTCNT1              RTCTIM0_L
#define RTCNT2              RTCTIM0_H
#define RTCNT3              RTCTIM1_L
#define RTCNT4              RTCTIM1_H
#define RTCSEC              RTCTIM0_L
#define RTCMIN              RTCTIM0_H
#define RTCHOUR             RTCTIM1_L
#define RTCDOW              RTCTIM1_H
#define RTCDAY              RTCDATE_L
#define RTCMON              RTCDATE_H
#define RTCYEARL            RTCYEAR_L
#define RTCYEARH            RTCYEAR_H

/* RTCCTL01 Control Bits */
#define RTCBCD              (0x8000)                   /* RTC BCD  0:Binary / 1:BCD */
#define RTCHOLD             (0x4000)                   /* RTC Hold */
#define RTCMODE             (0x2000)                   /* RTC Mode 0:Counter / 1: Calendar */
#define RTCRDY              (0x1000)                   /* RTC Ready */
#define RTCSSEL1            (0x0800)                   /* RTC Source Select 1 */
#define RTCSSEL0            (0x0400)                   /* RTC Source Select 0 */
#define RTCTEV1             (0x0200)                   /* RTC Time Event 1 */
#define RTCTEV0             (0x0100)                   /* RTC Time Event 0 */
//#define Reserved          (0x0080)
#define RTCTEVIE            (0x0040)                   /* RTC Time Event Interrupt Enable Flag */
#define RTCAIE              (0x0020)                   /* RTC Alarm Interrupt Enable Flag */
#define RTCRDYIE            (0x0010)                   /* RTC Ready Interrupt Enable Flag */
//#define Reserved          (0x0008)
#define RTCTEVIFG           (0x0004)                   /* RTC Time Event Interrupt Flag */
#define RTCAIFG             (0x0002)                   /* RTC Alarm Interrupt Flag */
#define RTCRDYIFG           (0x0001)                   /* RTC Ready Interrupt Flag */

/* RTCCTL01 Control Bits */
//#define Reserved          (0x0080)
#define RTCTEVIE_L          (0x0040)                   /* RTC Time Event Interrupt Enable Flag */
#define RTCAIE_L            (0x0020)                   /* RTC Alarm Interrupt Enable Flag */
#define RTCRDYIE_L          (0x0010)                   /* RTC Ready Interrupt Enable Flag */
//#define Reserved          (0x0008)
#define RTCTEVIFG_L         (0x0004)                   /* RTC Time Event Interrupt Flag */
#define RTCAIFG_L           (0x0002)                   /* RTC Alarm Interrupt Flag */
#define RTCRDYIFG_L         (0x0001)                   /* RTC Ready Interrupt Flag */

/* RTCCTL01 Control Bits */
#define RTCBCD_H            (0x0080)                   /* RTC BCD  0:Binary / 1:BCD */
#define RTCHOLD_H           (0x0040)                   /* RTC Hold */
#define RTCMODE_H           (0x0020)                   /* RTC Mode 0:Counter / 1: Calendar */
#define RTCRDY_H            (0x0010)                   /* RTC Ready */
#define RTCSSEL1_H          (0x0008)                   /* RTC Source Select 1 */
#define RTCSSEL0_H          (0x0004)                   /* RTC Source Select 0 */
#define RTCTEV1_H           (0x0002)                   /* RTC Time Event 1 */
#define RTCTEV0_H           (0x0001)                   /* RTC Time Event 0 */
//#define Reserved          (0x0080)
//#define Reserved          (0x0008)

#define RTCSSEL_0           (0x0000)                   /* RTC Source Select ACLK */
#define RTCSSEL_1           (0x0400)                   /* RTC Source Select SMCLK */
#define RTCSSEL_2           (0x0800)                   /* RTC Source Select RT1PS */
#define RTCSSEL_3           (0x0C00)                   /* RTC Source Select RT1PS */
#define RTCSSEL__ACLK       (0x0000)                   /* RTC Source Select ACLK */
#define RTCSSEL__SMCLK      (0x0400)                   /* RTC Source Select SMCLK */
#define RTCSSEL__RT1PS      (0x0800)                   /* RTC Source Select RT1PS */
#define RTCTEV_0            (0x0000)                   /* RTC Time Event: 0 (Min. changed) */
#define RTCTEV_1            (0x0100)                   /* RTC Time Event: 1 (Hour changed) */
#define RTCTEV_2            (0x0200)                   /* RTC Time Event: 2 (12:00 changed) */
#define RTCTEV_3            (0x0300)                   /* RTC Time Event: 3 (00:00 changed) */
#define RTCTEV__MIN         (0x0000)                   /* RTC Time Event: 0 (Min. changed) */
#define RTCTEV__HOUR        (0x0100)                   /* RTC Time Event: 1 (Hour changed) */
#define RTCTEV__1200        (0x0200)                   /* RTC Time Event: 2 (12:00 changed) */
#define RTCTEV__0000        (0x0300)                   /* RTC Time Event: 3 (00:00 changed) */

/* RTCCTL23 Control Bits */
#define RTCCALF1            (0x0200)                   /* RTC Calibration Frequency Bit 1 */
#define RTCCALF0            (0x0100)                   /* RTC Calibration Frequency Bit 0 */
#define RTCCALS             (0x0080)                   /* RTC Calibration Sign */
//#define Reserved          (0x0040)
#define RTCCAL5             (0x0020)                   /* RTC Calibration Bit 5 */
#define RTCCAL4             (0x0010)                   /* RTC Calibration Bit 4 */
#define RTCCAL3             (0x0008)                   /* RTC Calibration Bit 3 */
#define RTCCAL2             (0x0004)                   /* RTC Calibration Bit 2 */
#define RTCCAL1             (0x0002)                   /* RTC Calibration Bit 1 */
#define RTCCAL0             (0x0001)                   /* RTC Calibration Bit 0 */

/* RTCCTL23 Control Bits */
#define RTCCALS_L           (0x0080)                   /* RTC Calibration Sign */
//#define Reserved          (0x0040)
#define RTCCAL5_L           (0x0020)                   /* RTC Calibration Bit 5 */
#define RTCCAL4_L           (0x0010)                   /* RTC Calibration Bit 4 */
#define RTCCAL3_L           (0x0008)                   /* RTC Calibration Bit 3 */
#define RTCCAL2_L           (0x0004)                   /* RTC Calibration Bit 2 */
#define RTCCAL1_L           (0x0002)                   /* RTC Calibration Bit 1 */
#define RTCCAL0_L           (0x0001)                   /* RTC Calibration Bit 0 */

/* RTCCTL23 Control Bits */
#define RTCCALF1_H          (0x0002)                   /* RTC Calibration Frequency Bit 1 */
#define RTCCALF0_H          (0x0001)                   /* RTC Calibration Frequency Bit 0 */
//#define Reserved          (0x0040)

#define RTCCALF_0           (0x0000)                   /* RTC Calibration Frequency: No Output */
#define RTCCALF_1           (0x0100)                   /* RTC Calibration Frequency: 512 Hz */
#define RTCCALF_2           (0x0200)                   /* RTC Calibration Frequency: 256 Hz */
#define RTCCALF_3           (0x0300)                   /* RTC Calibration Frequency: 1 Hz */

/* RTCPS0CTL Control Bits */
//#define Reserved          (0x8000)
#define RT0SSEL             (0x4000)                   /* RTC Prescale Timer 0 Source Select 0:ACLK / 1:SMCLK */
#define RT0PSDIV2           (0x2000)                   /* RTC Prescale Timer 0 Clock Divide Bit: 2 */
#define RT0PSDIV1           (0x1000)                   /* RTC Prescale Timer 0 Clock Divide Bit: 1 */
#define RT0PSDIV0           (0x0800)                   /* RTC Prescale Timer 0 Clock Divide Bit: 0 */
//#define Reserved          (0x0400)
//#define Reserved          (0x0200)
#define RT0PSHOLD           (0x0100)                   /* RTC Prescale Timer 0 Hold */
//#define Reserved          (0x0080)
//#define Reserved          (0x0040)
//#define Reserved          (0x0020)
#define RT0IP2              (0x0010)                   /* RTC Prescale Timer 0 Interrupt Interval Bit: 2 */
#define RT0IP1              (0x0008)                   /* RTC Prescale Timer 0 Interrupt Interval Bit: 1 */
#define RT0IP0              (0x0004)                   /* RTC Prescale Timer 0 Interrupt Interval Bit: 0 */
#define RT0PSIE             (0x0002)                   /* RTC Prescale Timer 0 Interrupt Enalbe Flag */
#define RT0PSIFG            (0x0001)                   /* RTC Prescale Timer 0 Interrupt Flag */

/* RTCPS0CTL Control Bits */
//#define Reserved          (0x8000)
//#define Reserved          (0x0400)
//#define Reserved          (0x0200)
//#define Reserved          (0x0080)
//#define Reserved          (0x0040)
//#define Reserved          (0x0020)
#define RT0IP2_L            (0x0010)                   /* RTC Prescale Timer 0 Interrupt Interval Bit: 2 */
#define RT0IP1_L            (0x0008)                   /* RTC Prescale Timer 0 Interrupt Interval Bit: 1 */
#define RT0IP0_L            (0x0004)                   /* RTC Prescale Timer 0 Interrupt Interval Bit: 0 */
#define RT0PSIE_L           (0x0002)                   /* RTC Prescale Timer 0 Interrupt Enalbe Flag */
#define RT0PSIFG_L          (0x0001)                   /* RTC Prescale Timer 0 Interrupt Flag */

/* RTCPS0CTL Control Bits */
//#define Reserved          (0x8000)
#define RT0SSEL_H           (0x0040)                   /* RTC Prescale Timer 0 Source Select 0:ACLK / 1:SMCLK */
#define RT0PSDIV2_H         (0x0020)                   /* RTC Prescale Timer 0 Clock Divide Bit: 2 */
#define RT0PSDIV1_H         (0x0010)                   /* RTC Prescale Timer 0 Clock Divide Bit: 1 */
#define RT0PSDIV0_H         (0x0008)                   /* RTC Prescale Timer 0 Clock Divide Bit: 0 */
//#define Reserved          (0x0400)
//#define Reserved          (0x0200)
#define RT0PSHOLD_H         (0x0001)                   /* RTC Prescale Timer 0 Hold */
//#define Reserved          (0x0080)
//#define Reserved          (0x0040)
//#define Reserved          (0x0020)

