metalsky/DK5438_example/综合应用/05-uCOS-II与触控GUI/App/msp430x54xBK.h
/* SYSJMBC Control Bits */
#define JMBIN0FG            (0x0001)  /* SYS - Incoming JTAG Mailbox 0 Flag */
#define JMBIN1FG            (0x0002)  /* SYS - Incoming JTAG Mailbox 1 Flag */
#define JMBOUT0FG           (0x0004)  /* SYS - Outgoing JTAG Mailbox 0 Flag */
#define JMBOUT1FG           (0x0008)  /* SYS - Outgoing JTAG Mailbox 1 Flag */
#define JMBMODE             (0x0010)  /* SYS - JMB 16/32 Bit Mode */
//#define RESERVED            (0x0020)  /* SYS - Reserved */
#define JMBCLR0OFF          (0x0040)  /* SYS - Incoming JTAG Mailbox 0 Flag auto-clear disalbe */
#define JMBCLR1OFF          (0x0080)  /* SYS - Incoming JTAG Mailbox 1 Flag auto-clear disalbe */
//#define RESERVED            (0x0100)  /* SYS - Reserved */
//#define RESERVED            (0x0200)  /* SYS - Reserved */
//#define RESERVED            (0x0400)  /* SYS - Reserved */
//#define RESERVED            (0x0800)  /* SYS - Reserved */
//#define RESERVED            (0x1000)  /* SYS - Reserved */
//#define RESERVED            (0x2000)  /* SYS - Reserved */
//#define RESERVED            (0x4000)  /* SYS - Reserved */
//#define RESERVED            (0x8000)  /* SYS - Reserved */

/* SYSJMBC Control Bits */
#define JMBIN0FG_L          (0x0001)  /* SYS - Incoming JTAG Mailbox 0 Flag */
#define JMBIN1FG_L          (0x0002)  /* SYS - Incoming JTAG Mailbox 1 Flag */
#define JMBOUT0FG_L         (0x0004)  /* SYS - Outgoing JTAG Mailbox 0 Flag */
#define JMBOUT1FG_L         (0x0008)  /* SYS - Outgoing JTAG Mailbox 1 Flag */
#define JMBMODE_L           (0x0010)  /* SYS - JMB 16/32 Bit Mode */
//#define RESERVED            (0x0020)  /* SYS - Reserved */
#define JMBCLR0OFF_L        (0x0040)  /* SYS - Incoming JTAG Mailbox 0 Flag auto-clear disalbe */
#define JMBCLR1OFF_L        (0x0080)  /* SYS - Incoming JTAG Mailbox 1 Flag auto-clear disalbe */
//#define RESERVED            (0x0100)  /* SYS - Reserved */
//#define RESERVED            (0x0200)  /* SYS - Reserved */
//#define RESERVED            (0x0400)  /* SYS - Reserved */
//#define RESERVED            (0x0800)  /* SYS - Reserved */
//#define RESERVED            (0x1000)  /* SYS - Reserved */
//#define RESERVED            (0x2000)  /* SYS - Reserved */
//#define RESERVED            (0x4000)  /* SYS - Reserved */
//#define RESERVED            (0x8000)  /* SYS - Reserved */

/* SYSJMBC Control Bits */
//#define RESERVED            (0x0020)  /* SYS - Reserved */
//#define RESERVED            (0x0100)  /* SYS - Reserved */
//#define RESERVED            (0x0200)  /* SYS - Reserved */
//#define RESERVED            (0x0400)  /* SYS - Reserved */
//#define RESERVED            (0x0800)  /* SYS - Reserved */
//#define RESERVED            (0x1000)  /* SYS - Reserved */
//#define RESERVED            (0x2000)  /* SYS - Reserved */
//#define RESERVED            (0x4000)  /* SYS - Reserved */
//#define RESERVED            (0x8000)  /* SYS - Reserved */

/* SYSUNIV Definitions */
#define SYSUNIV_NONE       (0x0000)    /* No Interrupt pending */
#define SYSUNIV_NMIIFG     (0x0002)    /* SYSUNIV : NMIIFG */
#define SYSUNIV_OFIFG      (0x0004)    /* SYSUNIV : Osc. Fail - OFIFG */
#define SYSUNIV_ACCVIFG    (0x0006)    /* SYSUNIV : Access Violation - ACCVIFG */
#define SYSUNIV_SYSBERRIV  (0x0008)    /* SYSUNIV : Bus Error - SYSBERRIV */

/* SYSSNIV Definitions */
#define SYSSNIV_NONE       (0x0000)    /* No Interrupt pending */
#define SYSSNIV_SVMLIFG    (0x0002)    /* SYSSNIV : SVMLIFG */
#define SYSSNIV_SVMHIFG    (0x0004)    /* SYSSNIV : SVMHIFG */
#define SYSSNIV_DLYLIFG    (0x0006)    /* SYSSNIV : DLYLIFG */
#define SYSSNIV_DLYHIFG    (0x0008)    /* SYSSNIV : DLYHIFG */
#define SYSSNIV_VMAIFG     (0x000A)    /* SYSSNIV : VMAIFG */
#define SYSSNIV_JMBINIFG   (0x000C)    /* SYSSNIV : JMBINIFG */
#define SYSSNIV_JMBOUTIFG  (0x000E)    /* SYSSNIV : JMBOUTIFG */
#define SYSSNIV_VLRLIFG    (0x0010)    /* SYSSNIV : VLRLIFG */
#define SYSSNIV_VLRHIFG    (0x0012)    /* SYSSNIV : VLRHIFG */

/* SYSRSTIV Definitions */
#define SYSRSTIV_NONE      (0x0000)    /* No Interrupt pending */
#define SYSRSTIV_BOR       (0x0002)    /* SYSRSTIV : BOR */
#define SYSRSTIV_RSTNMI    (0x0004)    /* SYSRSTIV : RST/NMI */
#define SYSRSTIV_DOBOR     (0x0006)    /* SYSRSTIV : Do BOR */
#define SYSRSTIV_PORTWU    (0x0008)    /* SYSRSTIV : Port Wake Up */
#define SYSRSTIV_PORTWU2   (0x000A)    /* SYSRSTIV : Port Wake Up */
#define SYSRSTIV_SECYV     (0x000C)    /* SYSRSTIV : Security violation */
#define SYSRSTIV_SVSH      (0x000E)    /* SYSRSTIV : SVSH */
#define SYSRSTIV_SVML_OVP  (0x0010)    /* SYSRSTIV : SVML_OVP */
#define SYSRSTIV_SVMH_OVP  (0x0012)    /* SYSRSTIV : SVMH_OVP */
#define SYSRSTIV_DOPOR     (0x0014)    /* SYSRSTIV : Do POR */
#define SYSRSTIV_WDTTO     (0x0016)    /* SYSRSTIV : WDT Time out */
#define SYSRSTIV_WDTKEY    (0x0018)    /* SYSRSTIV : WDTKEY violation */
#define SYSRSTIV_KEYV      (0x001A)    /* SYSRSTIV : Flash Key violation */
#define SYSRSTIV_PLLUL     (0x001C)    /* SYSRSTIV : PLL unlock */
#define SYSRSTIV_PERF      (0x001E)    /* SYSRSTIV : peripheral/config area fetch */
#define SYSRSTIV_PSSKEY    (0x0020)    /* SYSRSTIV : PSSKEY violation */

/************************************************************
* Timer0_A5
************************************************************/
#define __MSP430_HAS_T0A5__           /* Definition to show that Module is available */

#define  TA0CTL_             (0x0340)  /* Timer1_A5 Control */
DEFCW(   TA0CTL            , TA0CTL_)
#define  TA0CCTL0_           (0x0342)  /* Timer1_A5 Capture/Compare Control 0 */
DEFCW(   TA0CCTL0          , TA0CCTL0_)
#define  TA0CCTL1_           (0x0344)  /* Timer1_A5 Capture/Compare Control 1 */
DEFCW(   TA0CCTL1          , TA0CCTL1_)
#define  TA0CCTL2_           (0x0346)  /* Timer1_A5 Capture/Compare Control 2 */
DEFCW(   TA0CCTL2          , TA0CCTL2_)
#define  TA0CCTL3_           (0x0348)  /* Timer1_A5 Capture/Compare Control 3 */
DEFCW(   TA0CCTL3          , TA0CCTL3_)
#define  TA0CCTL4_           (0x034A)  /* Timer1_A5 Capture/Compare Control 4 */
DEFCW(   TA0CCTL4          , TA0CCTL4_)
#define  TA0R_               (0x0350)  /* Timer1_A5 */
DEFCW(   TA0R              , TA0R_)
#define  TA0CCR0_            (0x0352)  /* Timer1_A5 Capture/Compare 0 */
DEFCW(   TA0CCR0           , TA0CCR0_)
#define  TA0CCR1_            (0x0354)  /* Timer1_A5 Capture/Compare 1 */
DEFCW(   TA0CCR1           , TA0CCR1_)
#define  TA0CCR2_            (0x0356)  /* Timer1_A5 Capture/Compare 2 */
DEFCW(   TA0CCR2           , TA0CCR2_)
#define  TA0CCR3_            (0x0358)  /* Timer1_A5 Capture/Compare 3 */
DEFCW(   TA0CCR3           , TA0CCR3_)
#define  TA0CCR4_            (0x035A)  /* Timer1_A5 Capture/Compare 4 */
DEFCW(   TA0CCR4           , TA0CCR4_)
#define TA0IV_              (0x036E)  /* Timer1_A5 Interrupt Vector Word */
READ_ONLY_DEFCW( TA0IV          , TA0IV_)
#define  TA0EX0_             (0x0360)  /* Timer0_A3 Expansion Register 0 */
DEFCW(   TA0EX0            , TA0EX0_)

/* TAxCTL Control Bits */
#define TASSEL1             (0x0200)  /* Timer A clock source select 0 */
#define TASSEL0             (0x0100)  /* Timer A clock source select 1 */
#define ID1                 (0x0080)  /* Timer A clock input divider 1 */
#define ID0                 (0x0040)  /* Timer A clock input divider 0 */
#define MC1                 (0x0020)  /* Timer A mode control 1 */
#define MC0                 (0x0010)  /* Timer A mode control 0 */
#define TACLR               (0x0004)  /* Timer A counter clear */
#define TAIE                (0x0002)  /* Timer A counter interrupt enable */
#define TAIFG               (0x0001)  /* Timer A counter interrupt flag */

/* TAxCTL Control Bits */
#define ID1_L               (0x0080)  /* Timer A clock input divider 1 */
#define ID0_L               (0x0040)  /* Timer A clock input divider 0 */
#define MC1_L               (0x0020)  /* Timer A mode control 1 */
#define MC0_L               (0x0010)  /* Timer A mode control 0 */
#define TACLR_L             (0x0004)  /* Timer A counter clear */
#define TAIE_L              (0x0002)  /* Timer A counter interrupt enable */
#define TAIFG_L             (0x0001)  /* Timer A counter interrupt flag */

/* TAxCTL Control Bits */
#define TASSEL1_H           (0x0002)  /* Timer A clock source select 0 */
#define TASSEL0_H           (0x0001)  /* Timer A clock source select 1 */

#define MC_0                (0*0x10u)  /* Timer A mode control: 0 - Stop */
#define MC_1                (1*0x10u)  /* Timer A mode control: 1 - Up to CCR0 */
#define MC_2                (2*0x10u)  /* Timer A mode control: 2 - Continous up */
#define MC_3                (3*0x10u)  /* Timer A mode control: 3 - Up/Down */
#define ID_0                (0*0x40u)  /* Timer A input divider: 0 - /1 */
#define ID_1                (1*0x40u)  /* Timer A input divider: 1 - /2 */
#define ID_2                (2*0x40u)  /* Timer A input divider: 2 - /4 */
#define ID_3                (3*0x40u)  /* Timer A input divider: 3 - /8 */
#define TASSEL_0            (0*0x100u) /* Timer A clock source select: 0 - TACLK */
#define TASSEL_1            (1*0x100u) /* Timer A clock source select: 1 - ACLK  */
#define TASSEL_2            (2*0x100u) /* Timer A clock source select: 2 - SMCLK */
#define TASSEL_3            (3*0x100u) /* Timer A clock source select: 3 - INCLK */
#define MC__STOP            (0*0x10u)  /* Timer A mode control: 0 - Stop */
#define MC__UP              (1*0x10u)  /* Timer A mode control: 1 - Up to CCR0 */
#define MC__CONTINOUS       (2*0x10u)  /* Timer A mode control: 2 - Continous up */
#define MC__UPDOWN          (3*0x10u)  /* Timer A mode control: 3 - Up/Down */
#define ID__1               (0*0x40u)  /* Timer A input divider: 0 - /1 */
#define ID__2               (1*0x40u)  /* Timer A input divider: 1 - /2 */
#define ID__4               (2*0x40u)  /* Timer A input divider: 2 - /4 */
#define ID__8               (3*0x40u)  /* Timer A input divider: 3 - /8 */
#define TASSEL__TACLK       (0*0x100u) /* Timer A clock source select: 0 - TACLK */
#define TASSEL__ACLK        (1*0x100u) /* Timer A clock source select: 1 - ACLK  */
#define TASSEL__SMCLK       (2*0x100u) /* Timer A clock source select: 2 - SMCLK */
#define TASSEL__INCLK       (3*0x100u) /* Timer A clock source select: 3 - INCLK */

/* TAxCTLx Control Bits */
#define CM1                 (0x8000)  /* Capture mode 1 */
#define CM0                 (0x4000)  /* Capture mode 0 */
#define CCIS1               (0x2000)  /* Capture input select 1 */
#define CCIS0               (0x1000)  /* Capture input select 0 */
#define SCS                 (0x0800)  /* Capture sychronize */
#define SCCI                (0x0400)  /* Latched capture signal (read) */
#define CAP                 (0x0100)  /* Capture mode: 1 /Compare mode : 0 */
#define OUTMOD2             (0x0080)  /* Output mode 2 */
#define OUTMOD1             (0x0040)  /* Output mode 1 */
#define OUTMOD0             (0x0020)  /* Output mode 0 */
#define CCIE                (0x0010)  /* Capture/compare interrupt enable */
#define CCI                 (0x0008)  /* Capture input signal (read) */
#define OUT                 (0x0004)  /* PWM Output signal if output mode 0 */
#define COV                 (0x0002)  /* Capture/compare overflow flag */
#define CCIFG               (0x0001)  /* Capture/compare interrupt flag */

/* TAxCTLx Control Bits */
#define OUTMOD2_L           (0x0080)  /* Output mode 2 */
#define OUTMOD1_L           (0x0040)  /* Output mode 1 */
#define OUTMOD0_L           (0x0020)  /* Output mode 0 */
#define CCIE_L              (0x0010)  /* Capture/compare interrupt enable */
#define CCI_L               (0x0008)  /* Capture input signal (read) */
#define OUT_L               (0x0004)  /* PWM Output signal if output mode 0 */
#define COV_L               (0x0002)  /* Capture/compare overflow flag */
#define CCIFG_L             (0x0001)  /* Capture/compare interrupt flag */

/* TAxCTLx Control Bits */
#define CM1_H               (0x0080)  /* Capture mode 1 */
#define CM0_H               (0x0040)  /* Capture mode 0 */
#define CCIS1_H             (0x0020)  /* Capture input select 1 */
#define CCIS0_H             (0x0010)  /* Capture input select 0 */
#define SCS_H               (0x0008)  /* Capture sychronize */
#define SCCI_H              (0x0004)  /* Latched capture signal (read) */
#define CAP_H               (0x0001)  /* Capture mode: 1 /Compare mode : 0 */

#define OUTMOD_0            (0*0x20u)  /* PWM output mode: 0 - output only */
#define OUTMOD_1            (1*0x20u)  /* PWM output mode: 1 - set */
#define OUTMOD_2            (2*0x20u)  /* PWM output mode: 2 - PWM toggle/reset */
#define OUTMOD_3            (3*0x20u)  /* PWM output mode: 3 - PWM set/reset */
#define OUTMOD_4            (4*0x20u)  /* PWM output mode: 4 - toggle */
#define OUTMOD_5            (5*0x20u)  /* PWM output mode: 5 - Reset */
#define OUTMOD_6            (6*0x20u)  /* PWM output mode: 6 - PWM toggle/set */
#define OUTMOD_7            (7*0x20u)  /* PWM output mode: 7 - PWM reset/set */
#define CCIS_0              (0*0x1000u) /* Capture input select: 0 - CCIxA */
#define CCIS_1              (1*0x1000u) /* Capture input select: 1 - CCIxB */
#define CCIS_2              (2*0x1000u) /* Capture input select: 2 - GND */
#define CCIS_3              (3*0x1000u) /* Capture input select: 3 - Vcc */
#define CM_0                (0*0x4000u) /* Capture mode: 0 - disabled */
#define CM_1                (1*0x4000u) /* Capture mode: 1 - pos. edge */
#define CM_2                (2*0x4000u) /* Capture mode: 1 - neg. edge */
#define CM_3                (3*0x4000u) /* Capture mode: 1 - both edges */

/* TAxEX0 Control Bits */
#define TAIDEX0             (0x0001)  /* Timer A Input divider expansion Bit: 0 */
#define TAIDEX1             (0x0002)  /* Timer A Input divider expansion Bit: 1 */
#define TAIDEX2             (0x0004)  /* Timer A Input divider expansion Bit: 2 */

/* TAxEX0 Control Bits */
#define TAIDEX0_L           (0x0001)  /* Timer A Input divider expansion Bit: 0 */
#define TAIDEX1_L           (0x0002)  /* Timer A Input divider expansion Bit: 1 */
#define TAIDEX2_L           (0x0004)  /* Timer A Input divider expansion Bit: 2 */

/* TAxEX0 Control Bits */

#define TAIDEX_0            (0*0x0001u) /* Timer A Input divider expansion : /1 */
#define TAIDEX_1            (1*0x0001u) /* Timer A Input divider expansion : /2 */
#define TAIDEX_2            (2*0x0001u) /* Timer A Input divider expansion : /3 */
#define TAIDEX_3            (3*0x0001u) /* Timer A Input divider expansion : /4 */
#define TAIDEX_4            (4*0x0001u) /* Timer A Input divider expansion : /5 */
#define TAIDEX_5            (5*0x0001u) /* Timer A Input divider expansion : /6 */
#define TAIDEX_6            (6*0x0001u) /* Timer A Input divider expansion : /7 */
#define TAIDEX_7            (7*0x0001u) /* Timer A Input divider expansion : /8 */

/* T0A5IV Definitions */
#define TA0IV_NONE          (0x0000)    /* No Interrupt pending */
#define TA0IV_TA0CCR1       (0x0002)    /* TA0CCR1_CCIFG */
#define TA0IV_TA0CCR2       (0x0004)    /* TA0CCR2_CCIFG */
#define TA0IV_TA0CCR3       (0x0006)    /* TA0CCR3_CCIFG */
#define TA0IV_TA0CCR4       (0x0008)    /* TA0CCR4_CCIFG */
#define TA0IV_5             (0x000A)    /* Reserved */
#define TA0IV_6             (0x000C)    /* Reserved */
#define TA0IV_TA0IFG        (0x000E)    /* TA0IFG */

/************************************************************
* Timer1_A3
************************************************************/
#define __MSP430_HAS_T1A3__            /* Definition to show that Module is available */

#define  TA1CTL_             (0x0380)  /* Timer0_A3 Control */
DEFCW(   TA1CTL            , TA1CTL_)
#define  TA1CCTL0_           (0x0382)  /* Timer0_A3 Capture/Compare Control 0 */
DEFCW(   TA1CCTL0          , TA1CCTL0_)
#define  TA1CCTL1_           (0x0384)  /* Timer0_A3 Capture/Compare Control 1 */
DEFCW(   TA1CCTL1          , TA1CCTL1_)
#define  TA1CCTL2_           (0x0386)  /* Timer0_A3 Capture/Compare Control 2 */
DEFCW(   TA1CCTL2          , TA1CCTL2_)
#define  TA1R_               (0x0390)  /* Timer0_A3 */
DEFCW(   TA1R              , TA1R_)
#define  TA1CCR0_            (0x0392)  /* Timer0_A3 Capture/Compare 0 */
DEFCW(   TA1CCR0           , TA1CCR0_)
#define  TA1CCR1_            (0x0394)  /* Timer0_A3 Capture/Compare 1 */
DEFCW(   TA1CCR1           , TA1CCR1_)
#define  TA1CCR2_            (0x0396)  /* Timer0_A3 Capture/Compare 2 */
DEFCW(   TA1CCR2           , TA1CCR2_)
#define TA1IV_              (0x03AE)  /* Timer0_A3 Interrupt Vector Word */
READ_ONLY_DEFCW( TA1IV          , TA1IV_)
#define  TA1EX0_             (0x03A0)  /* Timer0_A3 Expansion Register 0 */
DEFCW(   TA1EX0            , TA1EX0_)

/* Bits are already defined within the Timer0_Ax */

/* T1A3IV Definitions */
#define TA1IV_NONE          (0x0000)    /* No Interrupt pending */
#define TA1IV_TA1CCR1       (0x0002)    /* TA1CCR1_CCIFG */
#define TA1IV_TA1CCR2       (0x0004)    /* TA1CCR2_CCIFG */
#define TA1IV_3             (0x0006)    /* Reserved */
#define TA1IV_4             (0x0008)    /* Reserved */
#define TA1IV_5             (0x000A)    /* Reserved */
#define TA1IV_6             (0x000C)    /* Reserved */
#define TA1IV_TA1IFG        (0x000E)    /* TA1IFG */

/************************************************************
* Timer B7
************************************************************/
#define __MSP430_HAS_TB7__            /* Definition to show that Module is available */

