metalsky/DK5438_example/综合应用/05-uCOS-II与触控GUI/App/msp430x54xBK.h
#define  TBCTL_              (0x03C0)  /* Timer B Control */
DEFCW(   TBCTL             , TBCTL_)
#define  TBCCTL0_            (0x03C2)  /* Timer B Capture/Compare Control 0 */
DEFCW(   TBCCTL0           , TBCCTL0_)
#define  TBCCTL1_            (0x03C4)  /* Timer B Capture/Compare Control 1 */
DEFCW(   TBCCTL1           , TBCCTL1_)
#define  TBCCTL2_            (0x03C6)  /* Timer B Capture/Compare Control 2 */
DEFCW(   TBCCTL2           , TBCCTL2_)
#define  TBCCTL3_            (0x03C8)  /* Timer B Capture/Compare Control 3 */
DEFCW(   TBCCTL3           , TBCCTL3_)
#define  TBCCTL4_            (0x03CA)  /* Timer B Capture/Compare Control 4 */
DEFCW(   TBCCTL4           , TBCCTL4_)
#define  TBCCTL5_            (0x03CC)  /* Timer B Capture/Compare Control 5 */
DEFCW(   TBCCTL5           , TBCCTL5_)
#define  TBCCTL6_            (0x03CE)  /* Timer B Capture/Compare Control 6 */
DEFCW(   TBCCTL6           , TBCCTL6_)
#define  TBR_                (0x03D0)  /* Timer B */
DEFCW(   TBR               , TBR_)
#define  TBCCR0_             (0x03D2)  /* Timer B Capture/Compare 0 */
DEFCW(   TBCCR0            , TBCCR0_)
#define  TBCCR1_             (0x03D4)  /* Timer B Capture/Compare 1 */
DEFCW(   TBCCR1            , TBCCR1_)
#define  TBCCR2_             (0x03D6)  /* Timer B Capture/Compare 2 */
DEFCW(   TBCCR2            , TBCCR2_)
#define  TBCCR3_             (0x03D8)  /* Timer B Capture/Compare 3 */
DEFCW(   TBCCR3            , TBCCR3_)
#define  TBCCR4_             (0x03DA)  /* Timer B Capture/Compare 4 */
DEFCW(   TBCCR4            , TBCCR4_)
#define  TBCCR5_             (0x03DC)  /* Timer B Capture/Compare 5 */
DEFCW(   TBCCR5            , TBCCR5_)
#define  TBCCR6_             (0x03DE)  /* Timer B Capture/Compare 6 */
DEFCW(   TBCCR6            , TBCCR6_)
#define  TBEX0_              (0x03E0)  /* Timer B Expansion Register 0 */
DEFCW(   TBEX0             , TBEX0_)
#define TBIV_               (0x03EE)  /* Timer B Interrupt Vector Word */
READ_ONLY_DEFCW( TBIV           , TBIV_)

/* TBCTL Control Bits */
#define TBCLGRP1            (0x4000)  /* Timer B Compare latch load group 1 */
#define TBCLGRP0            (0x2000)  /* Timer B Compare latch load group 0 */
#define CNTL1               (0x1000)  /* Counter lenght 1 */
#define CNTL0               (0x0800)  /* Counter lenght 0 */
#define TBSSEL1             (0x0200)  /* Clock source 1 */
#define TBSSEL0             (0x0100)  /* Clock source 0 */
#define TBCLR               (0x0004)  /* Timer B counter clear */
#define TBIE                (0x0002)  /* Timer B interrupt enable */
#define TBIFG               (0x0001)  /* Timer B interrupt flag */

/* TBCTL Control Bits */
#define TBCLR_L             (0x0004)  /* Timer B counter clear */
#define TBIE_L              (0x0002)  /* Timer B interrupt enable */
#define TBIFG_L             (0x0001)  /* Timer B interrupt flag */

/* TBCTL Control Bits */
#define TBCLGRP1_H          (0x0040)  /* Timer B Compare latch load group 1 */
#define TBCLGRP0_H          (0x0020)  /* Timer B Compare latch load group 0 */
#define CNTL1_H             (0x0010)  /* Counter lenght 1 */
#define CNTL0_H             (0x0008)  /* Counter lenght 0 */
#define TBSSEL1_H           (0x0002)  /* Clock source 1 */
#define TBSSEL0_H           (0x0001)  /* Clock source 0 */

#define SHR1                (0x4000)  /* Timer B Compare latch load group 1 */
#define SHR0                (0x2000)  /* Timer B Compare latch load group 0 */

#define TBSSEL_0            (0*0x0100u)  /* Clock Source: TBCLK */
#define TBSSEL_1            (1*0x0100u)  /* Clock Source: ACLK  */
#define TBSSEL_2            (2*0x0100u)  /* Clock Source: SMCLK */
#define TBSSEL_3            (3*0x0100u)  /* Clock Source: INCLK */
#define CNTL_0              (0*0x0800u)  /* Counter lenght: 16 bit */
#define CNTL_1              (1*0x0800u)  /* Counter lenght: 12 bit */
#define CNTL_2              (2*0x0800u)  /* Counter lenght: 10 bit */
#define CNTL_3              (3*0x0800u)  /* Counter lenght:  8 bit */
#define SHR_0               (0*0x2000u)  /* Timer B Group: 0 - individually */
#define SHR_1               (1*0x2000u)  /* Timer B Group: 1 - 3 groups (1-2, 3-4, 5-6) */
#define SHR_2               (2*0x2000u)  /* Timer B Group: 2 - 2 groups (1-3, 4-6)*/
#define SHR_3               (3*0x2000u)  /* Timer B Group: 3 - 1 group (all) */
#define TBCLGRP_0           (0*0x2000u)  /* Timer B Group: 0 - individually */
#define TBCLGRP_1           (1*0x2000u)  /* Timer B Group: 1 - 3 groups (1-2, 3-4, 5-6) */
#define TBCLGRP_2           (2*0x2000u)  /* Timer B Group: 2 - 2 groups (1-3, 4-6)*/
#define TBCLGRP_3           (3*0x2000u)  /* Timer B Group: 3 - 1 group (all) */
#define TBSSEL__TACLK       (0*0x100u) /* Timer A clock source select: 0 - TACLK */
#define TBSSEL__ACLK        (1*0x100u) /* Timer A clock source select: 1 - ACLK  */
#define TBSSEL__SMCLK       (2*0x100u) /* Timer A clock source select: 2 - SMCLK */
#define TBSSEL__INCLK       (3*0x100u) /* Timer A clock source select: 3 - INCLK */
#define CNTL__16            (0*0x0800u)  /* Counter lenght: 16 bit */
#define CNTL__12            (1*0x0800u)  /* Counter lenght: 12 bit */
#define CNTL__10            (2*0x0800u)  /* Counter lenght: 10 bit */
#define CNTL__8             (3*0x0800u)  /* Counter lenght:  8 bit */

/* Additional Timer B Control Register bits are defined in Timer A */
/* TBCTLx Control Bits */
#define CLLD1               (0x0400)  /* Compare latch load source 1 */
#define CLLD0               (0x0200)  /* Compare latch load source 0 */

/* TBCTLx Control Bits */

/* TBCTLx Control Bits */
#define CLLD1_H             (0x0004)  /* Compare latch load source 1 */
#define CLLD0_H             (0x0002)  /* Compare latch load source 0 */

#define SLSHR1              (0x0400)  /* Compare latch load source 1 */
#define SLSHR0              (0x0200)  /* Compare latch load source 0 */

#define SLSHR_0             (0*0x0200u) /* Compare latch load sourec : 0 - immediate */
#define SLSHR_1             (1*0x0200u) /* Compare latch load sourec : 1 - TBR counts to 0 */
#define SLSHR_2             (2*0x0200u) /* Compare latch load sourec : 2 - up/down */
#define SLSHR_3             (3*0x0200u) /* Compare latch load sourec : 3 - TBR counts to TBCTL0 */

#define CLLD_0              (0*0x0200u) /* Compare latch load sourec : 0 - immediate */
#define CLLD_1              (1*0x0200u) /* Compare latch load sourec : 1 - TBR counts to 0 */
#define CLLD_2              (2*0x0200u) /* Compare latch load sourec : 2 - up/down */
#define CLLD_3              (3*0x0200u) /* Compare latch load sourec : 3 - TBR counts to TBCTL0 */

/* TBEX0 Control Bits */
#define TBIDEX0             (0x0001)   /* Timer B Input divider expansion Bit: 0 */
#define TBIDEX1             (0x0002)   /* Timer B Input divider expansion Bit: 1 */
#define TBIDEX2             (0x0004)   /* Timer B Input divider expansion Bit: 2 */

/* TBEX0 Control Bits */
#define TBIDEX0_L           (0x0001)   /* Timer B Input divider expansion Bit: 0 */
#define TBIDEX1_L           (0x0002)   /* Timer B Input divider expansion Bit: 1 */
#define TBIDEX2_L           (0x0004)   /* Timer B Input divider expansion Bit: 2 */

/* TBEX0 Control Bits */

