metalsky/DK5438_example/综合应用/05-uCOS-II与触控GUI/App/msp430x54xBK.h
/* UCSCTL8 Control Bits */
#define ACLKREQEN           (0x0001)    /* ACLK Clock Request Enable */
#define MCLKREQEN           (0x0002)    /* MCLK Clock Request Enable */
#define SMCLKREQEN          (0x0004)    /* SMCLK Clock Request Enable */
#define MODOSCREQEN         (0x0008)    /* MODOSC Clock Request Enable */
#define IFCLKSEN            (0x0010)    /* Enable Interface Clock slow down mechanism */
//#define RESERVED            (0x0020)    /* RESERVED */
//#define RESERVED            (0x0040)    /* RESERVED */
//#define RESERVED            (0x0080)    /* RESERVED */
#define SMCLK_FSEN          (0x0100)    /* Enable fail safe enable for SMCLK source */
#define ACLK_FSEN           (0x0200)    /* Enable fail safe enable for ACLK source */
//#define RESERVED            (0x0400)    /* RESERVED */
//#define RESERVED            (0x0800)    /* RESERVED */
//#define RESERVED            (0x1000)    /* RESERVED */
//#define RESERVED            (0x2000)    /* RESERVED */
//#define RESERVED            (0x4000)    /* RESERVED */
//#define RESERVED            (0x8000)    /* RESERVED */

/* UCSCTL8 Control Bits */
#define ACLKREQEN_L         (0x0001)    /* ACLK Clock Request Enable */
#define MCLKREQEN_L         (0x0002)    /* MCLK Clock Request Enable */
#define SMCLKREQEN_L        (0x0004)    /* SMCLK Clock Request Enable */
#define MODOSCREQEN_L       (0x0008)    /* MODOSC Clock Request Enable */
#define IFCLKSEN_L          (0x0010)    /* Enable Interface Clock slow down mechanism */
//#define RESERVED            (0x0020)    /* RESERVED */
//#define RESERVED            (0x0040)    /* RESERVED */
//#define RESERVED            (0x0080)    /* RESERVED */
//#define RESERVED            (0x0400)    /* RESERVED */
//#define RESERVED            (0x0800)    /* RESERVED */
//#define RESERVED            (0x1000)    /* RESERVED */
//#define RESERVED            (0x2000)    /* RESERVED */
//#define RESERVED            (0x4000)    /* RESERVED */
//#define RESERVED            (0x8000)    /* RESERVED */

/* UCSCTL8 Control Bits */
//#define RESERVED            (0x0020)    /* RESERVED */
//#define RESERVED            (0x0040)    /* RESERVED */
//#define RESERVED            (0x0080)    /* RESERVED */
#define SMCLK_FSEN_H        (0x0001)    /* Enable fail safe enable for SMCLK source */
#define ACLK_FSEN_H         (0x0002)    /* Enable fail safe enable for ACLK source */
//#define RESERVED            (0x0400)    /* RESERVED */
//#define RESERVED            (0x0800)    /* RESERVED */
//#define RESERVED            (0x1000)    /* RESERVED */
//#define RESERVED            (0x2000)    /* RESERVED */
//#define RESERVED            (0x4000)    /* RESERVED */
//#define RESERVED            (0x8000)    /* RESERVED */

/************************************************************
* USCI
************************************************************/
#define __MSP430_HAS_USCI__           /* Definition to show that Module is available */
#define __MSP430_HAS_USCI_AB0__       /* Definition to show that Module is available */
#define __MSP430_HAS_USCI_AB1__       /* Definition to show that Module is available */
#define __MSP430_HAS_USCI_AB2__       /* Definition to show that Module is available */
#define __MSP430_HAS_USCI_AB3__       /* Definition to show that Module is available */

#define UCA0CTL0_           (0x05C1)  /* USCI A0 Control Register 0 */
DEFC(   UCA0CTL0          , UCA0CTL0_)
#define UCA0CTL1_           (0x05C0)  /* USCI A0 Control Register 1 */
DEFC(   UCA0CTL1          , UCA0CTL1_)
#define UCA0BR0_            (0x05C6)  /* USCI A0 Baud Rate 0 */
DEFC(   UCA0BR0           , UCA0BR0_)
#define UCA0BR1_            (0x05C7)  /* USCI A0 Baud Rate 1 */
DEFC(   UCA0BR1           , UCA0BR1_)
#define UCA0MCTL_           (0x05C8)  /* USCI A0 Modulation Control */
DEFC(   UCA0MCTL          , UCA0MCTL_)
#define UCA0STAT_           (0x05CA)  /* USCI A0 Status Register */
DEFC(   UCA0STAT          , UCA0STAT_)
#define UCA0RXBUF_          (0x05CC)  /* USCI A0 Receive Buffer */
READ_ONLY DEFC( UCA0RXBUF      , UCA0RXBUF_)
#define UCA0TXBUF_          (0x05CE)  /* USCI A0 Transmit Buffer */
DEFC(   UCA0TXBUF         , UCA0TXBUF_)
#define UCA0ABCTL_          (0x05D0)  /* USCI A0 LIN Control */
DEFC(   UCA0ABCTL         , UCA0ABCTL_)
#define UCA0IRTCTL_         (0x05D2)  /* USCI A0 IrDA Transmit Control */
DEFC(   UCA0IRTCTL        , UCA0IRTCTL_)
#define UCA0IRRCTL_         (0x05D3)  /* USCI A0 IrDA Receive Control */
DEFC(   UCA0IRRCTL        , UCA0IRRCTL_)
#define UCA0IE_             (0x05DC)  /* USCI A0 Interrupt Enable Register */
DEFC(   UCA0IE            , UCA0IE_)
#define UCA0IFG_            (0x05DD)  /* USCI A0 Interrupt Flags Register */
DEFC(   UCA0IFG           , UCA0IFG_)
#define UCA0IV_             (0x05DE)  /* USCI A0 Interrupt Vector Register */
DEFW(   UCA0IV            , UCA0IV_)



#define UCB0CTL0_           (0x05E1)  /* USCI B0 Control Register 0 */
DEFC(   UCB0CTL0          , UCB0CTL0_)
#define UCB0CTL1_           (0x05E0)  /* USCI B0 Control Register 1 */
DEFC(   UCB0CTL1          , UCB0CTL1_)
#define UCB0BR0_            (0x05E6)  /* USCI B0 Baud Rate 0 */
DEFC(   UCB0BR0           , UCB0BR0_)
#define UCB0BR1_            (0x05E7)  /* USCI B0 Baud Rate 1 */
DEFC(   UCB0BR1           , UCB0BR1_)
#define UCB0STAT_           (0x05EA)  /* USCI B0 Status Register */
DEFC(   UCB0STAT          , UCB0STAT_)
#define UCB0RXBUF_          (0x05EC)  /* USCI B0 Receive Buffer */
READ_ONLY DEFC( UCB0RXBUF      , UCB0RXBUF_)
#define UCB0TXBUF_          (0x05EE)  /* USCI B0 Transmit Buffer */
DEFC(   UCB0TXBUF         , UCB0TXBUF_)
#define  UCB0I2COA_          (0x05F0)  /* USCI B0 I2C Own Address */
DEFCW(   UCB0I2COA         , UCB0I2COA_)
#define  UCB0I2CSA_          (0x05F2)  /* USCI B0 I2C Slave Address */
DEFCW(   UCB0I2CSA         , UCB0I2CSA_)
#define UCB0IE_             (0x05FC)  /* USCI B0 Interrupt Enable Register */
DEFC(   UCB0IE            , UCB0IE_)
#define UCB0IFG_            (0x05FD)  /* USCI B0 Interrupt Flags Register */
DEFC(   UCB0IFG           , UCB0IFG_)
#define UCB0IV_             (0x05FE)  /* USCI B0 Interrupt Vector Register */
DEFW(   UCB0IV            , UCB0IV_)

#define UCA1CTL0_           (0x0601)  /* USCI A1 Control Register 0 */
DEFC(   UCA1CTL0          , UCA1CTL0_)
#define UCA1CTL1_           (0x0600)  /* USCI A1 Control Register 1 */
DEFC(   UCA1CTL1          , UCA1CTL1_)
#define UCA1BR0_            (0x0606)  /* USCI A1 Baud Rate 0 */
DEFC(   UCA1BR0           , UCA1BR0_)
#define UCA1BR1_            (0x0607)  /* USCI A1 Baud Rate 1 */
DEFC(   UCA1BR1           , UCA1BR1_)
#define UCA1MCTL_           (0x0608)  /* USCI A1 Modulation Control */
DEFC(   UCA1MCTL          , UCA1MCTL_)
#define UCA1STAT_           (0x060A)  /* USCI A1 Status Register */
DEFC(   UCA1STAT          , UCA1STAT_)
#define UCA1RXBUF_          (0x060C)  /* USCI A1 Receive Buffer */
READ_ONLY DEFC( UCA1RXBUF      , UCA1RXBUF_)
#define UCA1TXBUF_          (0x060E)  /* USCI A1 Transmit Buffer */
DEFC(   UCA1TXBUF         , UCA1TXBUF_)
#define UCA1ABCTL_          (0x0610)  /* USCI A1 LIN Control */
DEFC(   UCA1ABCTL         , UCA1ABCTL_)
#define UCA1IRTCTL_         (0x0612)  /* USCI A1 IrDA Transmit Control */
DEFC(   UCA1IRTCTL        , UCA1IRTCTL_)
#define UCA1IRRCTL_         (0x0613)  /* USCI A1 IrDA Receive Control */
DEFC(   UCA1IRRCTL        , UCA1IRRCTL_)
#define UCA1IE_             (0x061C)  /* USCI A1 Interrupt Enable Register */
DEFC(   UCA1IE            , UCA1IE_)
#define UCA1IFG_            (0x061D)  /* USCI A1 Interrupt Flags Register */
DEFC(   UCA1IFG           , UCA1IFG_)
#define UCA1IV_             (0x061E)  /* USCI A1 Interrupt Vector Register */
DEFW(   UCA1IV            , UCA1IV_)



#define UCB1CTL0_           (0x0621)  /* USCI B1 Control Register 0 */
DEFC(   UCB1CTL0          , UCB1CTL0_)
#define UCB1CTL1_           (0x0620)  /* USCI B1 Control Register 1 */
DEFC(   UCB1CTL1          , UCB1CTL1_)
#define UCB1BR0_            (0x0626)  /* USCI B1 Baud Rate 0 */
DEFC(   UCB1BR0           , UCB1BR0_)
#define UCB1BR1_            (0x0627)  /* USCI B1 Baud Rate 1 */
DEFC(   UCB1BR1           , UCB1BR1_)
#define UCB1STAT_           (0x062A)  /* USCI B1 Status Register */
DEFC(   UCB1STAT          , UCB1STAT_)
#define UCB1RXBUF_          (0x062C)  /* USCI B1 Receive Buffer */
READ_ONLY DEFC( UCB1RXBUF      , UCB1RXBUF_)
#define UCB1TXBUF_          (0x062E)  /* USCI B1 Transmit Buffer */
DEFC(   UCB1TXBUF         , UCB1TXBUF_)
#define  UCB1I2COA_          (0x0630)  /* USCI B1 I2C Own Address */
DEFCW(   UCB1I2COA         , UCB1I2COA_)
#define  UCB1I2CSA_          (0x0632)  /* USCI B1 I2C Slave Address */
DEFCW(   UCB1I2CSA         , UCB1I2CSA_)
#define UCB1IE_             (0x063C)  /* USCI B1 Interrupt Enable Register */
DEFC(   UCB1IE            , UCB1IE_)
#define UCB1IFG_            (0x063D)  /* USCI B1 Interrupt Flags Register */
DEFC(   UCB1IFG           , UCB1IFG_)
#define UCB1IV_             (0x063E)  /* USCI B1 Interrupt Vector Register */
DEFW(   UCB1IV            , UCB1IV_)

