metalsky/DK5438_example/综合应用/05-uCOS-II与触控GUI/App/msp430x54xBK.h
#define UCA2CTL0_           (0x0641)  /* USCI A2 Control Register 0 */
DEFC(   UCA2CTL0          , UCA2CTL0_)
#define UCA2CTL1_           (0x0640)  /* USCI A2 Control Register 1 */
DEFC(   UCA2CTL1          , UCA2CTL1_)
#define UCA2BR0_            (0x0646)  /* USCI A2 Baud Rate 0 */
DEFC(   UCA2BR0           , UCA2BR0_)
#define UCA2BR1_            (0x0647)  /* USCI A2 Baud Rate 1 */
DEFC(   UCA2BR1           , UCA2BR1_)
#define UCA2MCTL_           (0x0648)  /* USCI A2 Modulation Control */
DEFC(   UCA2MCTL          , UCA2MCTL_)
#define UCA2STAT_           (0x064A)  /* USCI A2 Status Register */
DEFC(   UCA2STAT          , UCA2STAT_)
#define UCA2RXBUF_          (0x064C)  /* USCI A2 Receive Buffer */
READ_ONLY DEFC( UCA2RXBUF      , UCA2RXBUF_)
#define UCA2TXBUF_          (0x064E)  /* USCI A2 Transmit Buffer */
DEFC(   UCA2TXBUF         , UCA2TXBUF_)
#define UCA2ABCTL_          (0x0650)  /* USCI A2 LIN Control */
DEFC(   UCA2ABCTL         , UCA2ABCTL_)
#define UCA2IRTCTL_         (0x0652)  /* USCI A2 IrDA Transmit Control */
DEFC(   UCA2IRTCTL        , UCA2IRTCTL_)
#define UCA2IRRCTL_         (0x0653)  /* USCI A2 IrDA Receive Control */
DEFC(   UCA2IRRCTL        , UCA2IRRCTL_)
#define UCA2IE_             (0x065C)  /* USCI A2 Interrupt Enable Register */
DEFC(   UCA2IE            , UCA2IE_)
#define UCA2IFG_            (0x065D)  /* USCI A2 Interrupt Flags Register */
DEFC(   UCA2IFG           , UCA2IFG_)
#define UCA2IV_             (0x065E)  /* USCI A2 Interrupt Vector Register */
DEFW(   UCA2IV            , UCA2IV_)



#define UCB2CTL0_           (0x0661)  /* USCI B2 Control Register 0 */
DEFC(   UCB2CTL0          , UCB2CTL0_)
#define UCB2CTL1_           (0x0660)  /* USCI B2 Control Register 1 */
DEFC(   UCB2CTL1          , UCB2CTL1_)
#define UCB2BR0_            (0x0666)  /* USCI B2 Baud Rate 0 */
DEFC(   UCB2BR0           , UCB2BR0_)
#define UCB2BR1_            (0x0667)  /* USCI B2 Baud Rate 1 */
DEFC(   UCB2BR1           , UCB2BR1_)
#define UCB2STAT_           (0x066A)  /* USCI B2 Status Register */
DEFC(   UCB2STAT          , UCB2STAT_)
#define UCB2RXBUF_          (0x066C)  /* USCI B2 Receive Buffer */
READ_ONLY DEFC( UCB2RXBUF      , UCB2RXBUF_)
#define UCB2TXBUF_          (0x066E)  /* USCI B2 Transmit Buffer */
DEFC(   UCB2TXBUF         , UCB2TXBUF_)
#define  UCB2I2COA_          (0x0670)  /* USCI B2 I2C Own Address */
DEFCW(   UCB2I2COA         , UCB2I2COA_)
#define  UCB2I2CSA_          (0x0672)  /* USCI B2 I2C Slave Address */
DEFCW(   UCB2I2CSA         , UCB2I2CSA_)
#define UCB2IE_             (0x067C)  /* USCI B2 Interrupt Enable Register */
DEFC(   UCB2IE            , UCB2IE_)
#define UCB2IFG_            (0x067D)  /* USCI B2 Interrupt Flags Register */
DEFC(   UCB2IFG           , UCB2IFG_)
#define UCB2IV_             (0x067E)  /* USCI B2 Interrupt Vector Register */
DEFW(   UCB2IV            , UCB2IV_)

#define UCA3CTL0_           (0x0681)  /* USCI A3 Control Register 0 */
DEFC(   UCA3CTL0          , UCA3CTL0_)
#define UCA3CTL1_           (0x0680)  /* USCI A3 Control Register 1 */
DEFC(   UCA3CTL1          , UCA3CTL1_)
#define UCA3BR0_            (0x0686)  /* USCI A3 Baud Rate 0 */
DEFC(   UCA3BR0           , UCA3BR0_)
#define UCA3BR1_            (0x0687)  /* USCI A3 Baud Rate 1 */
DEFC(   UCA3BR1           , UCA3BR1_)
#define UCA3MCTL_           (0x0688)  /* USCI A3 Modulation Control */
DEFC(   UCA3MCTL          , UCA3MCTL_)
#define UCA3STAT_           (0x068A)  /* USCI A3 Status Register */
DEFC(   UCA3STAT          , UCA3STAT_)
#define UCA3RXBUF_          (0x068C)  /* USCI A3 Receive Buffer */
READ_ONLY DEFC( UCA3RXBUF      , UCA3RXBUF_)
#define UCA3TXBUF_          (0x068E)  /* USCI A3 Transmit Buffer */
DEFC(   UCA3TXBUF         , UCA3TXBUF_)
#define UCA3ABCTL_          (0x0690)  /* USCI A3 LIN Control */
DEFC(   UCA3ABCTL         , UCA3ABCTL_)
#define UCA3IRTCTL_         (0x0692)  /* USCI A3 IrDA Transmit Control */
DEFC(   UCA3IRTCTL        , UCA3IRTCTL_)
#define UCA3IRRCTL_         (0x0693)  /* USCI A3 IrDA Receive Control */
DEFC(   UCA3IRRCTL        , UCA3IRRCTL_)
#define UCA3IE_             (0x069C)  /* USCI A3 Interrupt Enable Register */
DEFC(   UCA3IE            , UCA3IE_)
#define UCA3IFG_            (0x069D)  /* USCI A3 Interrupt Flags Register */
DEFC(   UCA3IFG           , UCA3IFG_)
#define UCA3IV_             (0x069E)  /* USCI A3 Interrupt Vector Register */
DEFW(   UCA3IV            , UCA3IV_)



#define UCB3CTL0_           (0x06A1)  /* USCI B3 Control Register 0 */
DEFC(   UCB3CTL0          , UCB3CTL0_)
#define UCB3CTL1_           (0x06A0)  /* USCI B3 Control Register 1 */
DEFC(   UCB3CTL1          , UCB3CTL1_)
#define UCB3BR0_            (0x06A6)  /* USCI B3 Baud Rate 0 */
DEFC(   UCB3BR0           , UCB3BR0_)
#define UCB3BR1_            (0x06A7)  /* USCI B3 Baud Rate 1 */
DEFC(   UCB3BR1           , UCB3BR1_)
#define UCB3STAT_           (0x06AA)  /* USCI B3 Status Register */
DEFC(   UCB3STAT          , UCB3STAT_)
#define UCB3RXBUF_          (0x06AC)  /* USCI B3 Receive Buffer */
READ_ONLY DEFC( UCB3RXBUF      , UCB3RXBUF_)
#define UCB3TXBUF_          (0x06AE)  /* USCI B3 Transmit Buffer */
DEFC(   UCB3TXBUF         , UCB3TXBUF_)
#define  UCB3I2COA_          (0x06B0)  /* USCI B3 I2C Own Address */
DEFCW(   UCB3I2COA         , UCB3I2COA_)
#define  UCB3I2CSA_          (0x06B2)  /* USCI B3 I2C Slave Address */
DEFCW(   UCB3I2CSA         , UCB3I2CSA_)
#define UCB3IE_             (0x06BC)  /* USCI B3 Interrupt Enable Register */
DEFC(   UCB3IE            , UCB3IE_)
#define UCB3IFG_            (0x06BD)  /* USCI B3 Interrupt Flags Register */
DEFC(   UCB3IFG           , UCB3IFG_)
#define UCB3IV_             (0x06BE)  /* USCI B3 Interrupt Vector Register */
DEFW(   UCB3IV            , UCB3IV_)

// UCAxCTL0 UART-Mode Control Bits
#define UCPEN               (0x80)    /* Async. Mode: Parity enable */
#define UCPAR               (0x40)    /* Async. Mode: Parity     0:odd / 1:even */
#define UCMSB               (0x20)    /* Async. Mode: MSB first  0:LSB / 1:MSB */
#define UC7BIT              (0x10)    /* Async. Mode: Data Bits  0:8-bits / 1:7-bits */
#define UCSPB               (0x08)    /* Async. Mode: Stop Bits  0:one / 1: two */
#define UCMODE1             (0x04)    /* Async. Mode: USCI Mode 1 */
#define UCMODE0             (0x02)    /* Async. Mode: USCI Mode 0 */
#define UCSYNC              (0x01)    /* Sync-Mode  0:UART-Mode / 1:SPI-Mode */

// UCxxCTL0 SPI-Mode Control Bits
#define UCCKPH              (0x80)    /* Sync. Mode: Clock Phase */
#define UCCKPL              (0x40)    /* Sync. Mode: Clock Polarity */
#define UCMST               (0x08)    /* Sync. Mode: Master Select */

// UCBxCTL0 I2C-Mode Control Bits
#define UCA10               (0x80)    /* 10-bit Address Mode */
#define UCSLA10             (0x40)    /* 10-bit Slave Address Mode */
#define UCMM                (0x20)    /* Multi-Master Environment */
//#define res               (0x10)    /* reserved */
#define UCMODE_0            (0x00)    /* Sync. Mode: USCI Mode: 0 */
#define UCMODE_1            (0x02)    /* Sync. Mode: USCI Mode: 1 */
#define UCMODE_2            (0x04)    /* Sync. Mode: USCI Mode: 2 */
#define UCMODE_3            (0x06)    /* Sync. Mode: USCI Mode: 3 */

// UCAxCTL1 UART-Mode Control Bits
#define UCSSEL1             (0x80)    /* USCI 0 Clock Source Select 1 */
#define UCSSEL0             (0x40)    /* USCI 0 Clock Source Select 0 */
#define UCRXEIE             (0x20)    /* RX Error interrupt enable */
#define UCBRKIE             (0x10)    /* Break interrupt enable */                    
#define UCDORM              (0x08)    /* Dormant (Sleep) Mode */
#define UCTXADDR            (0x04)    /* Send next Data as Address */
#define UCTXBRK             (0x02)    /* Send next Data as Break */
#define UCSWRST             (0x01)    /* USCI Software Reset */

// UCxxCTL1 SPI-Mode Control Bits
//#define res               (0x20)    /* reserved */
//#define res               (0x10)    /* reserved */
//#define res               (0x08)    /* reserved */
//#define res               (0x04)    /* reserved */
//#define res               (0x02)    /* reserved */

// UCBxCTL1 I2C-Mode Control Bits
//#define res               (0x20)    /* reserved */
#define UCTR                (0x10)    /* Transmit/Receive Select/Flag */
#define UCTXNACK            (0x08)    /* Transmit NACK */
#define UCTXSTP             (0x04)    /* Transmit STOP */
#define UCTXSTT             (0x02)    /* Transmit START */
#define UCSSEL_0            (0x00)    /* USCI 0 Clock Source: 0 */
#define UCSSEL_1            (0x40)    /* USCI 0 Clock Source: 1 */
#define UCSSEL_2            (0x80)    /* USCI 0 Clock Source: 2 */
#define UCSSEL_3            (0xC0)    /* USCI 0 Clock Source: 3 */

/* UCAxMCTL Control Bits */
#define UCBRF3              (0x80)    /* USCI First Stage Modulation Select 3 */
#define UCBRF2              (0x40)    /* USCI First Stage Modulation Select 2 */
#define UCBRF1              (0x20)    /* USCI First Stage Modulation Select 1 */
#define UCBRF0              (0x10)    /* USCI First Stage Modulation Select 0 */
#define UCBRS2              (0x08)    /* USCI Second Stage Modulation Select 2 */
#define UCBRS1              (0x04)    /* USCI Second Stage Modulation Select 1 */
#define UCBRS0              (0x02)    /* USCI Second Stage Modulation Select 0 */
#define UCOS16              (0x01)    /* USCI 16-times Oversampling enable */

#define UCBRF_0             (0x00)    /* USCI First Stage Modulation: 0 */
#define UCBRF_1             (0x10)    /* USCI First Stage Modulation: 1 */
#define UCBRF_2             (0x20)    /* USCI First Stage Modulation: 2 */
#define UCBRF_3             (0x30)    /* USCI First Stage Modulation: 3 */
#define UCBRF_4             (0x40)    /* USCI First Stage Modulation: 4 */
#define UCBRF_5             (0x50)    /* USCI First Stage Modulation: 5 */
#define UCBRF_6             (0x60)    /* USCI First Stage Modulation: 6 */
#define UCBRF_7             (0x70)    /* USCI First Stage Modulation: 7 */
#define UCBRF_8             (0x80)    /* USCI First Stage Modulation: 8 */
#define UCBRF_9             (0x90)    /* USCI First Stage Modulation: 9 */
#define UCBRF_10            (0xA0)    /* USCI First Stage Modulation: A */
#define UCBRF_11            (0xB0)    /* USCI First Stage Modulation: B */
#define UCBRF_12            (0xC0)    /* USCI First Stage Modulation: C */
#define UCBRF_13            (0xD0)    /* USCI First Stage Modulation: D */
#define UCBRF_14            (0xE0)    /* USCI First Stage Modulation: E */
#define UCBRF_15            (0xF0)    /* USCI First Stage Modulation: F */

#define UCBRS_0             (0x00)    /* USCI Second Stage Modulation: 0 */
#define UCBRS_1             (0x02)    /* USCI Second Stage Modulation: 1 */
#define UCBRS_2             (0x04)    /* USCI Second Stage Modulation: 2 */
#define UCBRS_3             (0x06)    /* USCI Second Stage Modulation: 3 */
#define UCBRS_4             (0x08)    /* USCI Second Stage Modulation: 4 */
#define UCBRS_5             (0x0A)    /* USCI Second Stage Modulation: 5 */
#define UCBRS_6             (0x0C)    /* USCI Second Stage Modulation: 6 */
#define UCBRS_7             (0x0E)    /* USCI Second Stage Modulation: 7 */

